//
//  Data.swift
//  hw2
//
//  Created by 郭垣佑 on 2020/4/14.
//  Copyright © 2020 郭垣佑. All rights reserved.
//

import Foundation

let songs = [
 Song(name: "你,好不好", singer: "周興哲",lyrics: "都怪我 把自尊放太高\n沒有把你照顧好\n驕傲 是脆弱的外表\n最怕我的心你不要\n 能不能繼續 對我哭 對我笑 對我好\n繼續讓我 為你想 為你瘋 陪你老\n你好不好 好想知道\n別急著把回憶都丟掉\n我只需要你 在身邊 陪我吵 陪我鬧\n用好的我 把過去 壞的我 都換掉\n好想聽到 你堅決說愛我\n可惜回不去那一秒\n你好不好"),
 Song(name: "怎麼了", singer: "周興哲",lyrics: "怎麼能輕易說要結束\n怎麼會讓你抱著我哭\n太努力的我們最後用力給祝福\n怎麼看你笑著 我卻心如刀割\n原來我們都一樣頑固\n怎麼會誰都絕口不提要幸福\n再也不能牽著你走未來每一步\n我們懷念什麼 失去愛那一刻才曉得"),
 Song(name: "如果雨之後", singer: "周興哲", lyrics: "如果雨之後 淚還不停流 \n如果悲傷後 眼神更執著\n那一雙不能牽的手 那疼愛已無人簽收\n像片雲 奔走在天空沒盡頭 \n如果雨之後 心還是嫉妒 \n如果悲傷後 我少了溫度 \n不想要誰將你呵護 \n可什麼我都留不住\n我們還沒結束 我好不服輸"),
 Song(name: "以後別做朋友", singer: "周興哲",lyrics: "習慣聽你分享生活細節\n害怕破壞完美的平衡點\n保持著距離一顆心的遙遠\n我的寂寞你就聽不見\n 我走回從前你往未來飛\n遇見對的人錯過交叉點\n明明你就已經站在我面前\n我卻不斷揮手說再見\n 以後別做朋友 朋友不能牽手\n想愛你的衝動 我只能笑著帶過\n最好的朋友 有些夢 不能說出口\n就不用承擔 會失去你的心痛")

]
